"""@mao1312"""

ADMIN = ['331583382', '1422194909']  # Если нужно несколько админов то пишем ['12312', '45645'], если один то ['12312']
# ADMIN = ['331583382', '548445359']  #Если нужно несколько админов то пишем ['12312', '45645'], если один то ['12312']

TOKEN = ""

LOGO = r'telegram/media/logo.jpg'

BONUS = r'telegram/media/bonus.jpg'

SCREEN = r'telegram/media/screen.jpeg'

SUMMA = 5

START_MESSAGE = 'Здравствуйте! Спасибо, что обратились в нашу службу поддержки клиентов.' \
                '\n\nВыберите, пожалуйста, один из вариантов.'

BONUS_MESSAGE = 'Чтобы получить бонус, сделайте несколько простых действий.\n\n' \
                '1. Откройте приложение Wildberries на телефоне.\n' \
                '2. Нажмите на иконку профиля в нижнем правом углу.\n' \
                '3. Выберете категорию «Покупки»\n' \
                '4. Выберите товар, на который хотите оставить отзыв.\n' \
                '5. Найдите строчку «Отзывы», обычно находится под описанием товара.\n' \
                '6. Нажмите кнопку «Оставить отзыв».\n' \
                '7. Поставьте товару 5 звезд.\n' \
                '8. Напишите текстовый комментарий. За отзыв с фотографией будет двойной бонус 2x'

SCREEN_MSG = 'Сделайте скриншот оставленного отзыва и отправьте его сюда' \
             ' (Отправляйте, пожалуйста, только скриншот, без текста).'

GOOD_SCREEN_MSG = 'Введите, пожалуйста, номер телефона для получения бонуса в формате +7XXXXXXXXXX'

GOOD_BONUS = f'Спасибо! Ваш отзыв отправлен на проверку. Ожидайте ответа!'

QUEST_MSG = f'Пришлите Ваш вопрос и мы обязательно решим его'

NO_TEXT = f'Ваша команда не распознана. Воспользуйтесь меню'

ERROR_SCREEN = f'⚠️ Вы не верно прислали скриншот подтверждения оплаты!\n\n' \
               f'Пришлите мне следующим сообщением скриншот Вашего перевода\n\n'

ERROR_PHONE = f'⚠️ Вы не верно прислали номер телефона для получения бонуса!\n\n' \
              f'Пришлите мне следующим сообщением телефон в формате +7XXXXXXXXXX\n\n'

KEYB_TEXT1 = '🎁 Бонусы за отзывы'

KEYB_TEXT2 = '📩 Задать вопрос'

KEYB_TEXT3 = '✅ Я оставил(-а) отзыв'

KEYB_TEXT4 = '🌐 Главное меню'
